content-filter-app/testing/performance-tests.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 60
      arrivalRate: 5
      name: "Warm up phase"
    - duration: 300
      arrivalRate: 10
      name: "Main load test"
    - duration: 60
      arrivalRate: 20
      name: "Peak load test"
  defaults:
    headers:
      Content-Type: 'application/json'
      X-API-Key: 'cf_test_key'

scenarios:
  - name: "API Health Check"
    weight: 30
    flow:
      - get:
          url: "/api/health"
          expect:
            - statusCode: 200

  - name: "Content Analysis"
    weight: 50
    flow:
      - post:
          url: "/api/categorize"
          json:
            url: "https://example.com/test-content"
          expect:
            - statusCode: 200
            - hasProperty: 'success'

  - name: "Blocklist Retrieval"
    weight: 20
    flow:
      - get:
          url: "/api/blocklists"
          expect:
            - statusCode: 200
            - hasProperty: 'blocklists'

  - name: "Statistics Retrieval"
    weight: 15
    flow:
      - get:
          url: "/api/stats"
          expect:
            - statusCode: 200

  - name: "User Registration"
    weight: 5
    flow:
      - post:
          url: "/api/users"
          json:
            email: "test{{ $randomInt(1, 100000) }}@example.com"
            password: "testpassword123"
          expect:
            - statusCode: 201

  - name: "Content Filtering"
    weight: 40
    flow:
      - post:
          url: "/api/filter"
          json:
            content: "This is test content that should be filtered for inappropriate material"
            userId: "test-user-{{ $randomInt(1, 1000) }}"
          expect:
            - statusCode: 200
            - hasProperty: 'isBlocked'

# Load testing for browser extension
browserScenarios:
  - name: "Browser Extension Loading"
    weight: 25
    flow:
      - get:
          url: "file:///{{ $processEnvironment.PWD }}/browser-extension/popup.html"
          expect:
            - statusCode: 200

  - name: "Extension Settings Page"
    weight: 15
    flow:
      - get:
          url: "file:///{{ $processEnvironment.PWD }}/browser-extension/options.html"
          expect:
            - statusCode: 200

# Stress testing scenarios
stressTests:
  - name: "High Load Test"
    duration: 120
    arrivalRate: 50
    flow:
      - get:
          url: "/api/health"

  - name: "Concurrent Users Test"
    duration: 180
    arrivalCount: 100
    flow:
      - post:
          url: "/api/categorize"
          json:
            url: "https://test-site-{{ $randomInt(1, 1000) }}.com"

# Performance thresholds
thresholds:
  - http.response_time.p95: 1000ms  # 95th percentile response time < 1s
  - http.response_time.p99: 2000ms  # 99th percentile response time < 2s
  - http.request_rate: 100/second   # Handle at least 100 requests per second
  - http.error_rate: 0.1%          # Error rate < 0.1%

# Reporting
reporter:
  - type: "html"
    filename: "performance-report.html"
  - type: "json"
    filename: "performance-results.json"
  - type: "csv"
    filename: "performance-metrics.csv"

# Plugins for enhanced monitoring
plugins:
  ensure:
    - maxErrorRate: 1
    - maxResponseTime: 2000
  metrics:
    - responseTime
    - requestsPerSecond
    - errorRate
    - throughput
  expectations:
    - expectResponseTime:
        max: 1000
    - expectThroughput:
        min: 100